# 엔화 매출이 담겨 있는 파이썬 리스트가 주어졌습니다.
# 1엔에 10.08원이라고 가정하고, 원화 매출이 담긴 numpy array를 만들어 출력해 주세요.
import numpy as np

revenue_in_yen = [
    300000, 340000, 320000, 360000,
    440000, 140000, 180000, 340000,
    330000, 290000, 280000, 380000,
    170000, 140000, 230000, 390000,
    400000, 350000, 380000, 150000,
    110000, 240000, 380000, 380000,
    340000, 420000, 150000, 130000,
    360000, 320000, 250000
]
# 엔화 -> 원화
yen_array = np.array(revenue_in_yen)
won_array_yen = yen_array * 10.08
# print(won_array_yen)

# 1엔에 10.08원, 1달러에 1138원이라고 가정하세요. 그리고 두 지점의 매출의 합이 원화로 담긴 numpy array를 만들어 출력해주세요.
revenue_in_dollar = [
    1200, 1600, 1400, 1300,
    2100, 1400, 1500, 2100,
    1500, 1500, 2300, 2100,
    2800, 2600, 1700, 1400,
    2100, 2300, 1600, 1800,
    2200, 2400, 2100, 2800,
    1900, 2100, 1800, 2200,
    2100, 1600, 1800
]
# 달러 -> 원화
dollar_array = np.array(revenue_in_dollar)
won_array_dollar = dollar_array * 1138
# print(won_array_dollar)

# 합계
won_array = won_array_yen + won_array_dollar
print(won_array)

# 성공적이지 않은 날의 매출만 골라서 보고 싶습니다. 20만 엔 이하의 매출만 담긴 numpy array를 출력해주세요.
revenue_in_yen = [
    300000, 340000, 320000, 360000,
    440000, 140000, 180000, 340000,
    330000, 290000, 280000, 380000,
    170000, 140000, 230000, 390000,
    400000, 350000, 380000, 150000,
    110000, 240000, 380000, 380000,
    340000, 420000, 150000, 130000,
    360000, 320000, 250000
]

array_yen = np.array(revenue_in_yen)
filter = np.where(array_yen <= 200000)
bad_days_revenue = array_yen[filter]

# 20만 엔 이하의 매출
print(bad_days_revenue)